/* automatically generated by rust-bindgen 0.72.1 */

use std::io::Write;

pub const AJBSP_VERSION: &[u8; 5] = b"1.07\0";
pub const SPLIT_COST_MIN: u32 = 1;
pub const SPLIT_COST_DEFAULT: u32 = 11;
pub const SPLIT_COST_MAX: u32 = 32;
#[repr(C)]
pub struct buildinfo_t__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct buildinfo_t {
    pub vtable_: *const buildinfo_t__bindgen_vtable,
    pub fast: bool,
    pub gl_nodes: bool,
    pub do_blockmap: bool,
    pub do_reject: bool,
    pub force_v5: bool,
    pub force_xnod: bool,
    pub ssect_xgl3: bool,
    pub force_compress: bool,
    pub cancelled: bool,
    pub split_cost: ::std::os::raw::c_int,
    pub verbosity: ::std::os::raw::c_int,
    pub total_warnings: ::std::os::raw::c_int,
    pub total_minor_issues: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of buildinfo_t"][::std::mem::size_of::<buildinfo_t>() - 40usize];
    ["Alignment of buildinfo_t"][::std::mem::align_of::<buildinfo_t>() - 8usize];
    ["Offset of field: buildinfo_t::fast"][::std::mem::offset_of!(buildinfo_t, fast) - 8usize];
    ["Offset of field: buildinfo_t::gl_nodes"]
        [::std::mem::offset_of!(buildinfo_t, gl_nodes) - 9usize];
    ["Offset of field: buildinfo_t::do_blockmap"]
        [::std::mem::offset_of!(buildinfo_t, do_blockmap) - 10usize];
    ["Offset of field: buildinfo_t::do_reject"]
        [::std::mem::offset_of!(buildinfo_t, do_reject) - 11usize];
    ["Offset of field: buildinfo_t::force_v5"]
        [::std::mem::offset_of!(buildinfo_t, force_v5) - 12usize];
    ["Offset of field: buildinfo_t::force_xnod"]
        [::std::mem::offset_of!(buildinfo_t, force_xnod) - 13usize];
    ["Offset of field: buildinfo_t::ssect_xgl3"]
        [::std::mem::offset_of!(buildinfo_t, ssect_xgl3) - 14usize];
    ["Offset of field: buildinfo_t::force_compress"]
        [::std::mem::offset_of!(buildinfo_t, force_compress) - 15usize];
    ["Offset of field: buildinfo_t::cancelled"]
        [::std::mem::offset_of!(buildinfo_t, cancelled) - 16usize];
    ["Offset of field: buildinfo_t::split_cost"]
        [::std::mem::offset_of!(buildinfo_t, split_cost) - 20usize];
    ["Offset of field: buildinfo_t::verbosity"]
        [::std::mem::offset_of!(buildinfo_t, verbosity) - 24usize];
    ["Offset of field: buildinfo_t::total_warnings"]
        [::std::mem::offset_of!(buildinfo_t, total_warnings) - 28usize];
    ["Offset of field: buildinfo_t::total_minor_issues"]
        [::std::mem::offset_of!(buildinfo_t, total_minor_issues) - 32usize];
};
pub const build_result_e_BUILD_OK: build_result_e = 0;
pub const build_result_e_BUILD_Cancelled: build_result_e = 1;
pub const build_result_e_BUILD_LumpOverflow: build_result_e = 2;
pub type build_result_e = ::std::os::raw::c_uint;
unsafe extern "C" {
    #[link_name = "\u{1}SetInfo"]
    pub fn ajbsp_SetInfo(info: *mut buildinfo_t);
}
unsafe extern "C" {
    #[link_name = "\u{1}OpenWad"]
    pub fn ajbsp_OpenWad(filename: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    #[link_name = "\u{1}CloseWad"]
    pub fn ajbsp_CloseWad();
}
unsafe extern "C" {
    #[link_name = "\u{1}CreateXWA"]
    pub fn ajbsp_CreateXWA(filename: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    #[link_name = "\u{1}FinishXWA"]
    pub fn ajbsp_FinishXWA();
}
unsafe extern "C" {
    #[link_name = "\u{1}LevelsInWad"]
    pub fn ajbsp_LevelsInWad() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}GetLevelName"]
    pub fn ajbsp_GetLevelName(lev_idx: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}BuildLevel"]
    pub fn ajbsp_BuildLevel(lev_idx: ::std::os::raw::c_int) -> build_result_e;
}

// buildinfo_t dummy virtual function
extern "C" fn dummy_fn() {}

extern "C-unwind" fn fatal_error() {
    panic!("Fatal error occurred during node building");
}

// Safe-ish wrappers
impl buildinfo_t {
    pub fn new() -> Self {
        Self {
            vtable_: [
                dummy_fn as *const (),
                dummy_fn as *const (),
                dummy_fn as *const (),
                fatal_error as *const (),
            ]
            .as_ptr() as *const buildinfo_t__bindgen_vtable,
            fast: false,
            gl_nodes: true,
            do_blockmap: false,
            do_reject: false,
            force_v5: false,
            force_xnod: false,
            ssect_xgl3: true,
            force_compress: false,
            cancelled: false,
            split_cost: SPLIT_COST_DEFAULT as i32,
            verbosity: 0,
            total_warnings: 0,
            total_minor_issues: 0,
        }
    }
}

pub fn set_info(info: &mut buildinfo_t) {
    unsafe {
        ajbsp_SetInfo(&mut *info);
    }
}

pub fn open_wad(file_name: &str) {
    if !file_name.is_ascii() {
        panic!("File name {} is not ASCII", file_name);
    }
    let mut terminated_string = String::from(file_name);
    terminated_string.push('\0');
    unsafe {
        ajbsp_OpenWad(terminated_string.as_ptr() as *const i8);
    }
}

pub fn close_wad() {
    unsafe {
        ajbsp_CloseWad();
    }
}

pub fn create_xwa(file_name: &str) {
    if !file_name.is_ascii() {
        panic!("File name {} is not ASCII", file_name);
    }
    let mut terminated_string = String::from(file_name);
    terminated_string.push('\0');
    unsafe {
        ajbsp_CreateXWA(terminated_string.as_ptr() as *const i8);
    }
}

pub fn finish_xwa() {
    unsafe {
        ajbsp_FinishXWA();
    }
}

pub fn levels_in_wad() -> i32 {
    unsafe { ajbsp_LevelsInWad() }
}

pub fn get_level_name(level_idx: i32) -> String {
    if levels_in_wad() == 0 {
        return String::new();
    }

    unsafe {
        let mut ptr = ajbsp_GetLevelName(level_idx);

        let mut name = String::new();
        while *ptr != 0 {
            name.push(*ptr as u8 as char);
            ptr = ptr.add(1);
        }

        name
    }
}

pub fn build_level(level_idx: i32) -> Result<(), build_result_e> {
    if levels_in_wad() == 0 {
        return Err(build_result_e_BUILD_Cancelled);
    }
    unsafe {
        let result = ajbsp_BuildLevel(level_idx);
        if result == build_result_e_BUILD_OK {
            return Ok(());
        } else {
            return Err(result);
        }
    }
}
